# Stage 1 - Data Cleaning and Manipulation with Pandas

For this stage, you will start with this messy dataset Forbes Billionaires 2018. You will need to import it, use your data cleaning skills to clean it up, prepare it to be analyzed, and then export it as a clean CSV data file. Here `http://potacho.com/files/ironhack/<your-kaggle-name>.db` you may find the `.db` file with the raw dataset. 

Deliverables:
- Produce at least one Jupyter Notebook that shows the steps you took and the code you used to acquire, wrangle (clean and transform), analyze and report your data.
- Produce at least one processed data file (any format) that you will use in upcoming stages.

Suggested tools: pandas, pathlib, sqlalchemy, matplotlib, seaborn, plotly

In [75]:
#Import pandas and sqlite3
import pandas as pd
import numpy as np
import sqlite3
import re
import os
import matplotlib.pyplot as plt

In [76]:
#Create a conection to bbdd throught SQLite
conex = sqlite3.connect("/Users/borjauria/IRONHACK/Ironhack-Module-1-Project---The-best-ever-project/data/raw/borjauria.db")

#Extracts the query data directly to a DataFrame
personal_info = pd.read_sql_query("SELECT * from personal_info", conex)
business_info = pd.read_sql_query("SELECT * from business_info", conex)
rank_info = pd.read_sql_query("SELECT * from rank_info", conex)

In [77]:
#Preview of data
df_outer = pd.merge(personal_info, business_info, on='id', how='outer')
df = pd.merge(df_outer, rank_info, on='id', how='outer')
df.head(2)

,id,lastName,age,Unnamed: 0_x,gender,country,image,Unnamed: 0_y,Source,worth,worthChange,realTimeWorth,realTimePosition,name,position,Unnamed: 0
0,1849,bEZOS,54 years old,52.0,M,United States,https://specials-images.forbesimg.com/imageser...,52.0,Technology ==> Amazon,112.0 BUSD,0.0 millions USD,None,1.0,jefF BEzos,1.0,52
1,3727,gATES,62 years old,53.0,M,United States,https://specials-images.forbesimg.com/imageser...,53.0,Technology ==> Microsoft,90.0 BUSD,-0.001 millions USD,None,2.0,bill GAtes,2.0,53

In [78]:
#I change the name of the rows to know
df.rename(columns={'lastName':'Last Name', 'age': 'Age', 'Unnamed: 0': 'Unnamed', 'gender': 'Gender', 'country': 'From', 'name': 'Name'}, inplace=True)
df.head(2)

,id,Last Name,Age,Unnamed: 0_x,Gender,From,image,Unnamed: 0_y,Source,worth,worthChange,realTimeWorth,realTimePosition,Name,position,Unnamed
0,1849,bEZOS,54 years old,52.0,M,United States,https://specials-images.forbesimg.com/imageser...,52.0,Technology ==> Amazon,112.0 BUSD,0.0 millions USD,None,1.0,jefF BEzos,1.0,52
1,3727,gATES,62 years old,53.0,M,United States,https://specials-images.forbesimg.com/imageser...,53.0,Technology ==> Microsoft,90.0 BUSD,-0.001 millions USD,None,2.0,bill GAtes,2.0,53

In [79]:
# Replace Values
df['Age'] = df['Age'].str.replace(r"[a-zA-Z]+",'')
df['From'] = df['From'].str.replace(r"USA|USA",'United States')
df['Name'] = df['Name'].str.replace(r"( \S+)",'')
df['Gender'] = df['Gender'].str.replace(r"[M]",'Male')
df['Gender'] = df['Gender'].str.replace(r"Maleale",'Male')
df['Gender'] = df['Gender'].str.replace(r"(^F$)",'Female')
df['worth'] = df['worth'].str.replace(r"[a-zA-Z]+",'')
df['worthChange'] = df['worthChange'].str.replace(r"[a-zA-Z]+",'')
df.head(2)

,id,Last Name,Age,Unnamed: 0_x,Gender,From,image,Unnamed: 0_y,Source,worth,worthChange,realTimeWorth,realTimePosition,Name,position,Unnamed
0,1849,bEZOS,54,52.0,Male,United States,https://specials-images.forbesimg.com/imageser...,52.0,Technology ==> Amazon,112.0,0.0,None,1.0,jefF,1.0,52
1,3727,gATES,62,53.0,Male,United States,https://specials-images.forbesimg.com/imageser...,53.0,Technology ==> Microsoft,90.0,-0.001,None,2.0,bill,2.0,53

In [80]:
# Convert all inside of "Last Name" in lowercase.
df['Last Name'] = df['Last Name'].str.capitalize()
df.head(2)

,id,Last Name,Age,Unnamed: 0_x,Gender,From,image,Unnamed: 0_y,Source,worth,worthChange,realTimeWorth,realTimePosition,Name,position,Unnamed
0,1849,Bezos,54,52.0,Male,United States,https://specials-images.forbesimg.com/imageser...,52.0,Technology ==> Amazon,112.0,0.0,None,1.0,jefF,1.0,52
1,3727,Gates,62,53.0,Male,United States,https://specials-images.forbesimg.com/imageser...,53.0,Technology ==> Microsoft,90.0,-0.001,None,2.0,bill,2.0,53

In [81]:
df.rename(columns={'Unnamed: 0': 'Unnamed', 'Source': 'Source & company', 'worthChange': 'Worth Change', 'realTimeWorth': 'Real Time Worth', 'realTimePosition': 'Real Time Position'}, inplace=True)

In [82]:
# I create a new data frame without 'Real Time Worth column, Unnamed: 0_x, Unnamed: 0_y, Unnamed'.
df = df.drop('Real Time Worth', 1)
df = df.drop('Unnamed: 0_x', 1)
df = df.drop('Unnamed: 0_y', 1)
df = df.drop('Unnamed', 1)

In [83]:
#New data frame with split value columns from Source & Company
df[['Industry','Company']] = df["Source & company"].str.split("==> ",expand=True)
df.head(2)

,id,Last Name,Age,Gender,From,image,Source & company,worth,Worth Change,Real Time Position,Name,position,Industry,Company
0,1849,Bezos,54,Male,United States,https://specials-images.forbesimg.com/imageser...,Technology ==> Amazon,112.0,0.0,1.0,jefF,1.0,Technology,Amazon
1,3727,Gates,62,Male,United States,https://specials-images.forbesimg.com/imageser...,Technology ==> Microsoft,90.0,-0.001,2.0,bill,2.0,Technology,Microsoft

In [84]:
#New data frame without the 'Source & company' column.
df = df.drop('Source & company', 1)

In [62]:
df['Name'] = df['Name'].str.capitalize()
df.head(2)

,id,Last Name,Age,Gender,From,image,worth,Worth Change,Real Time Position,Name,position,Industry,Company
0,1849,Bezos,54,Male,United States,https://specials-images.forbesimg.com/imageser...,112.0,0.0,1.0,Jeff,1.0,Technology,Amazon
1,3727,Gates,62,Male,United States,https://specials-images.forbesimg.com/imageser...,90.0,-0.001,2.0,Bill,2.0,Technology,Microsoft

In [12]:
df['Last Name'].fillna('none', inplace=True)
df['Gender'].fillna('', inplace=True)
df['From'].fillna('none', inplace=True)
df['Photo'].fillna('none', inplace=True)
df['worth'].fillna('none', inplace=True)
df['Worth Change'].fillna('none', inplace=True)
df['Real Time Position'].fillna('none', inplace=True)
df['position'].fillna('none', inplace=True)
df['Industry'].fillna('none', inplace=True)
df['Company'].fillna('none', inplace=True)

In [13]:
# Here I change the type of the data
df['Age'].replace(to_replace='None',value=-9999, inplace=True)
df['Gender'].replace(to_replace='None', inplace=True)
df['From'].replace(to_replace='None', inplace=True)
df['Age'].fillna(-9999, inplace=True)
df = df.astype({'Age':int})
df.loc[df['Age']> 100, 'Age'] = 2018 - df['Age']

In [14]:
df['Gender'].replace('', np.nan, inplace=True)
df['From'].replace('', np.nan, inplace=True)

In [15]:
df = df.dropna()

In [16]:
df['Name'] = df['Name'] +' '+ df['Last Name']

In [17]:
df = df[['id','Name','Age','Gender','From', 'Industry','Company','worth','Worth Change','Real Time Position','Photo']]

In [18]:
# Saving the dataframe 
df.to_csv(r'/Users/borjauria/IRONHACK/Ironhack-Module-1-Project---The-best-ever-project/data/processed/borjauria_done.csv', index=False)